export default {
    "/datahub/": [
        {
            "text": "Datahub",
            "collapsible": true,
            "children": [
                "Datahub入门",
                "元数据摄入",
                "Modeling - 建造模型"
            ]
        }
    ],
    "/microservice-demo/": [
        {
            "text": "微服务DEMO🧩",
            "collapsible": true,
            "children": [
                "00",
                "1.环境",
                "2.前端基础",
                "3.配置网关路由与路径重写",
                "4.跨域",
                "5.文件存储",
                "6.前端校验",
                "7.后端校验（JSR303）",
                "8.商品服务-[概念]SPU&SKU&规格参数&销售属性",
                "9.分页-MyBatis Plus分页插件",
                "10.Object划分",
                "11.分层逻辑",
                "12.会员服务接口调试-ttmall-member",
                "13.开启远程调用product - coupon",
                "14.Elasticsearch - 全文检索",
                "15.Feign执行流程",
                "16.项目微服务",
                "17.Nginx+Widowns搭建域名访问环境",
                "18.压力测试",
                "19.缓存",
                "20.异步&线程池",
                "21.商城业务 - 商品详情",
                "22.RabbitMQ",
                "23.视图映射",
                "24.订单服务",
                "25.分布式事务",
                "26.内网穿透",
                "27.秒杀 - Sentinel",
                "28.定时任务",
                "29.集群部署 - kubernaters",
                "30.集群部署 - kubersphere"
            ]
        }
    ],
    "/jp/": [
        {
            "text": "日本語",
            "collapsible": true,
            "children": [
                "01.五十音"
            ]
        }
    ],
    "/shell/": [
        {
            "text": "shell入门💻",
            "collapsible": true,
            "children": [
                "一、概述",
                "二、Shell解释器",
                "三、Shell脚本入门",
                "四、Shell中的变量",
                "五、运算符",
                "六、条件判断",
                "七、流程控制",
                "八、read读取控制台输入",
                "九、函数（重点）",
                "十、Shell工具（重点）"
            ]
        }
    ],
    "/tools/": [
        {
            "text": "工具🔧",
            "collapsible": false
        }
    ],
    "/sawaru-sakana/": [
        {
            "text": "摸鱼🐟",
            "collapsible": false
        }
    ],
}